In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pylab as plt

In [2]:
properties = pd.read_csv('data/diamonds_properties.csv')
transactional = pd.read_csv('data/diamonds_transactional.csv')
dimensions = pd.read_csv('data/diamonds_dimensions.csv')
city = pd.read_csv('data/diamonds_city.csv')
clarity = pd.read_csv('data/diamonds_clarity.csv')
color = pd.read_csv('data/diamonds_color.csv')
cut = pd.read_csv('data/diamonds_cut.csv')

In [3]:
properties.head(1)

,index_id,cut_id,color_id,clarity_id
0,5feceb66ffc86f38d952786c6d696c79c2dbc239dd4e91...,de88c121a82a06352bf1aaceba20578356408a334ba046...,6da43b944e494e885e69af021f93c6d9331c78aa228084...,f0b2a1d0db08cc64f85d74f1d15c2191e0e49039f4d8f2...

In [4]:
transactional.head(1)

,index_id,price,city_id,carat
0,5feceb66ffc86f38d952786c6d696c79c2dbc239dd4e91...,4268,89c7286890f7347ab235234e74d406596a127ae3679042...,1.21

In [5]:
dimensions.head(1)

,index_id,depth,table,x,y,z
0,5feceb66ffc86f38d952786c6d696c79c2dbc239dd4e91...,62.4,58.0,6.83,6.79,4.25

In [6]:
city.head(1)

                                             city_id       city
0  0013c01fe0d094209b8bd3d23b8f96dbabcd01ddd2a039...  Amsterdam

In [7]:
clarity.head(1)

                                          clarity_id clarity
0  03c358cbd92e83278fd523f58dc6a9b4b198d00728af65...     SI2

In [8]:
color.head(1)

                                            color_id color
0  333e0a1e27815d0ceee55c473fe3dc93d56c63e3bee2b3...     G

In [9]:
cut.head(1)

                                              cut_id        cut
0  388655e25e91872329272fc10128ef5354b3b19a05d7e8...  Very Good

In [10]:
properties.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40455 entries, 0 to 40454
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   index_id    40455 non-null  object
 1   cut_id      40455 non-null  object
 2   color_id    40455 non-null  object
 3   clarity_id  40455 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

## merge

In [24]:
print(len(properties))
diamonds = properties.merge(transactional) \
                     .merge(city).drop('city_id',
                                       axis=1) \
                     .merge(cut).drop('cut_id',
                                      axis=1) \
                     .merge(color).drop('color_id',
                                        axis=1) \
                     .merge(clarity).drop('clarity_id',
                                          axis=1) \
                     .merge(dimensions)
print(len(diamonds))
diamonds

40455
40455

,index_id,price,carat,city,cut,color,clarity,depth,table,x,y,z
0,5feceb66ffc86f38d952786c6d696c79c2dbc239dd4e91...,4268,1.21,Kimberly,Premium,J,VS2,62.4,58.0,6.83,6.79,4.25
1,248aa2bdd0032920ac9e5f6ad36c350549da067efeaf7b...,4839,1.20,Kimberly,Premium,J,VS2,60.8,60.0,6.85,6.89,4.18
2,72b31cf00f8ab3967588fad4a32f61622cb162f9b7bc2c...,368,0.30,Kimberly,Premium,J,VS2,60.6,59.0,4.34,4.38,2.64
3,98c53df687f2e9b94da80eef5b9049f1fac456b4c41c80...,5053,1.20,Kimberly,Premium,J,VS2,62.6,57.0,6.80,6.72,4.23
4,5dfe43a321c6834c7de273c73aeadc705d919a5869e0f5...,3593,1.05,Kimberly,Premium,J,VS2,59.4,62.0,6.66,6.58,3.93
...,...,...,...,...,...,...,...,...,...,...,...,...
40450,097db724e4c3e305e3cab516a90727b5ba198654479af6...,2632,0.59,Paris,Very Good,F,IF,59.9,63.0,5.44,5.47,3.27
40451,7a2f5310cf8293f60a9103040d9a0ac0a9ce1d625f5121...,9972,1.01,Paris,Very Good,F,IF,63.5,59.0,6.29,6.41,4.03
40452,7d6fb002a947a9c894eb5c2a5a12be30cb7d4af83a29d9...,886,0.30,Paris,Very Good,F,IF,62.4,56.0,4.28,4.31,2.68
40453,7880bd7fe5dcd28637eade8b95c42961c6c5acffa946a6...,3205,0.71,Antwerp,Fair,F,IF,58.7,62.0,5.87,5.81,3.43
40454,bfcae0114088c1767863ef9463f93f442215b9c671c24e...,1166,0.37,Paris,Fair,F,IF,52.3,61.0,4.96,4.91,2.58

In [25]:
diamonds.describe()

,price,carat,depth,table,x,y,z
count,40455.000000,40455.000000,40455.000000,40455.000000,40455.000000,40455.000000,40455.000000
mean,3928.444469,0.797706,61.752841,57.446133,5.729392,5.732819,3.537154
std,3992.416147,0.475544,1.431725,2.233535,1.124453,1.146650,0.697062
min,326.000000,0.200000,43.000000,43.000000,0.000000,0.000000,0.000000
25%,945.000000,0.400000,61.000000,56.000000,4.710000,4.720000,2.910000
50%,2397.000000,0.700000,61.800000,57.000000,5.690000,5.710000,3.520000
75%,5331.000000,1.040000,62.500000,59.000000,6.540000,6.540000,4.035000
max,18823.000000,4.500000,79.000000,95.000000,10.230000,58.900000,8.060000